tap "aws/tap"
tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "infisical/get-cli"
tap "mongodb/brew"
tap "oven-sh/bun"
tap "planetscale/tap"
tap "shivammathur/php"
brew "act"
brew "giflib"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "automake"
brew "node"
brew "aws-cdk"
brew "pycparser"
brew "cffi"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "azure-cli"
brew "glib"
brew "cairo"
brew "harfbuzz"
brew "openjdk"
brew "bfg"
brew "cfn-lint"
brew "libavif"
brew "gd"
brew "libpq"
brew "php", link: false
brew "composer"
brew "cookiecutter"
brew "gnutls"
brew "leptonica"
brew "libass"
brew "libmicrohttpd"
brew "librist"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gcc"
brew "gdk-pixbuf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-extras"
brew "libheif"
brew "graphicsmagick"
brew "grep"
brew "imagemagick"
brew "jpeg"
brew "keyring"
brew "libfido2"
brew "librsvg"
brew "libxml2"
brew "libxslt"
brew "mysql-client"
brew "neonctl"
brew "node@20"
brew "nvm"
brew "openssl@1.1"
brew "pipx"
brew "pkg-config"
brew "pnpm"
brew "poetry"
brew "pre-commit"
brew "pyenv"
brew "rename"
brew "ruff"
brew "stow"
brew "tree"
brew "virtualenv"
brew "wget"
brew "wimlib"
brew "yarn"
brew "zsh-syntax-highlighting"
brew "azure/functions/azure-functions-core-tools@4"
brew "infisical/get-cli/infisical"
brew "mongodb/brew/mongodb-database-tools"
brew "oven-sh/bun/bun"
brew "planetscale/tap/pscale"
brew "shivammathur/php/php@7.2"
brew "shivammathur/php/php@7.4", link: true
cask "1password"
cask "anydesk"
cask "beardedspice"
cask "datagrip"
cask "figma"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "google-chrome"
cask "karabiner-elements"
cask "microsoft-remote-desktop"
cask "ngrok"
cask "notion"
cask "orbstack"
cask "teamviewer"
cask "vlc"
cask "whatsapp"
vscode "aeschli.vscode-css-formatter"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "coder.coder-remote"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gitpod.gitpod-desktop"
vscode "grapecity.gc-excelviewer"
vscode "hbenl.vscode-test-explorer"
vscode "ionutvmi.path-autocomplete"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "matangover.mypy"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-pt-br"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "netcorext.uuid-generator"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "yzhang.markdown-all-in-one"
