tap "aws/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "infisical/get-cli"
tap "oven-sh/bun"
tap "planetscale/tap"

brew "giflib"
brew "libtiff"
brew "webp"
brew "jpeg-xl"
brew "aws-cdk"
brew "pycparser"
brew "cffi"
brew "aws-sam-cli"
brew "python@3.11"
brew "awscli"
brew "cairo"
brew "harfbuzz"
brew "bfg"
brew "curl"
brew "libavif"
brew "gd"
brew "php"
brew "composer"
brew "gcc"
brew "leptonica"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "gh"
brew "git"
brew "git-extras"
brew "grep"
brew "libheif"
brew "imagemagick"
brew "jpeg"
brew "librsvg"
brew "mysql-client"
brew "nvm"
brew "openssl@1.1"
brew "pipx"
brew "pkg-config"
brew "pnpm"
brew "virtualenv"
brew "poetry"
brew "pre-commit"
brew "rename"
brew "ruff"
brew "stow"
brew "wget"
brew "wimlib"
brew "zsh-syntax-highlighting"
brew "infisical/get-cli/infisical"
brew "oven-sh/bun/bun"
brew "planetscale/tap/pscale"
